Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Kotlin `suspend` function returning `X`: Specifies a non-blocking method where the returned item is sent to the client as a response.
ja_jp: `X` を返す Kotlin の `suspend` 関数: 返された項目がレスポンスとしてクライアントに送信されるノンブロッキングメソッドを指定します。

source: Kotlin `suspend` function returning `X`: Specifies a non-blocking method where the returned item is sent to the client.
ja_jp: `X` を返す Kotlin の `suspend` 関数: 返された項目がクライアントに送信されるノンブロッキングメソッドを指定します。

source: Kotlin `suspend` functions are always considered non-blocking and may not be annotated with `@Blocking`, `@NonBlocking` or `@RunOnVirtualThread` and may not be in a class annotated with `@RunOnVirtualThread`.
ja_jp: Kotlin の `suspend` 関数は常にノンブロッキングとみなされるため、 `@Blocking`、 `@NonBlocking`、 `@RunOnVirtualThread` アノテーションのいずれかを付与することはできません。 また、 `@RunOnVirtualThread` アノテーションが付けられたクラス内に含めることもできません。

source: Kotlin `suspended` methods
ja_jp: Kotlin の `suspended` メソッド

source: Kotlin and Jackson
ja_jp: Kotlin と Jackson

source: Kotlin and Scala upgrade
ja_jp: KotlinとScalaのアップグレード

source: Kotlin and the Kubernetes Client
ja_jp: KotlinとKubernetesクライアント

source: Kotlin co-routines - a way to write asynchronous code in a sequential manner
ja_jp: Kotlin co-routines - 非同期のコードを逐次的に記述する方法

source: Kotlin code generation
ja_jp: Kotlinコード生成

source: Kotlin coroutines and Mutiny
ja_jp: Kotlin coroutines と Mutiny

source: Kotlin coroutines provide a imperative programming model that actually gets executed in an asynchronous, reactive manner. To simplify the interoperation between Mutiny and Kotlin there is the module `io.smallrye.reactive:mutiny-kotlin`, described link:https://smallrye.io/smallrye-mutiny/guides/kotlin[here].
ja_jp: Kotlinのコルーチンは、非同期でリアクティブな方法で実際に実行される命令型プログラミングモデルを提供します。MutinyとKotlinの相互運用を簡単にするために、モジュール `io.smallrye.reactive:mutiny-kotlin` が存在し、 link:https://smallrye.io/smallrye-mutiny/guides/kotlin[ここ] で解説されています。

source: Kotlin coroutines provide an imperative programming model that actually gets executed in an asynchronous, reactive manner. To simplify the interoperability between Mutiny and Kotlin there is the module `io.smallrye.reactive:mutiny-kotlin`, described link:https://smallrye.io/smallrye-mutiny/latest/guides/kotlin/[here].
ja_jp: Kotlinのコルーチンは、非同期でリアクティブな方法で実際に実行される命令型プログラミングモデルを提供します。MutinyとKotlinの相互運用を簡単にするために、モジュール `io.smallrye.reactive:mutiny-kotlin` が存在し、 link:https://smallrye.io/smallrye-mutiny/latest/guides/kotlin/[ここ] で解説されています。

source: Kotlin data classes are a very convenient way of defining data carrier classes, making them a great match to define an entity class.
ja_jp: Kotlinのデータクラスは、データキャリアクラスを定義する非常に便利な方法であり、エンティティクラスを定義するのに適しています。

source: Kotlin has been upgraded to 1.6.20.
ja_jp: Kotlinが1.6.20にアップグレードされました。

source: Kotlin reflection annotation processing differs from Java. You may experience an error when using CDI @Inject such as: "kotlin.UninitializedPropertyAccessException: lateinit property xxx has not been initialized"
ja_jp: Kotlinのリフレクションアノテーション処理はJavaとは異なります。CDIの@Injectを使用していると、以下のようなエラーが発生することがあります。"kotlin.UninitializedPropertyAccessException: lateinitプロパティーxxxが初期化されていません"

source: Kotlin requires a @field: xxx qualifier as it has no @Target on the annotation definition. Add @field: xxx in this example. @Default is used as the qualifier, explicitly specifying the use of the default bean.
ja_jp: Kotlinでは、アノテーション定義に@Targetがないため、@field: xxx修飾子が必要です。この例では @field: xxx を追加します。@Defaultが修飾子として使用され、デフォルトBeanの使用を明示的に指定します。

source: Kotlin serialization
ja_jp: Kotlinシリアライゼーション

source: Kotlin serialization support for RESTEasy Reactive
ja_jp: RESTEasy ReactiveにおけるKotlinシリアライゼーションのサポート

source: Kotlin support for MongoDB with Panache
ja_jp: MongoDB with PanacheのKotlinサポート

source: Kotlin version
ja_jp: Kotlin バージョン

source: Kubernetes Client
ja_jp: Kubernetesクライアント

source: Kubernetes Client Config customization
ja_jp: Kubernetes クライアント設定のカスタマイズ

source: Kubernetes Client ObjectMapper customization
ja_jp: KubernetesクライアントObjectMapperのカスタマイズ

source: Kubernetes Native Java:: our preferred tagline to say that we rock for containers
ja_jp: Kubernetes Native Java:: コンテナを支持するという私達の推奨キャッチフレーズ

source: Kubernetes Permissions
ja_jp: Kubernetesのパーミッション

source: Kubernetes Service Binding
ja_jp: Kubernetesサービスバインディング

source: Kubernetes Service Binding simplifies the deployment on Kubernetes.
ja_jp: Kubernetes Service Bindingは、Kubernetes上へのデプロイを簡素化します。

source: Kubernetes Service Bindings
ja_jp: Kubernetes サービスバインディング

source: Kubernetes Service Discovery and Selection with Stork
ja_jp: Kubernetesのサービスディスカバリーとロードバランシング

source: Kubernetes and Knative friendly
ja_jp: KubernetesとKnativeフレンドリー

source: Kubernetes configuration example
ja_jp: Kubernetes設定例

source: Kubernetes configurations could be kept closer to the service
ja_jp: Kubernetesの設定をよりサービスに近づけることができました

source: Kubernetes descriptors are provided for various flavors of Kubernetes: https://www.openshift.com[OpenShift^], https://quarkus.io/guides/deploying-to-kubernetes#deploying-to-minikube[Minikube^], https://knative.dev[KNative^], and “vanilla” https://www.kubernetes.io[Kubernetes^].
ja_jp: Kubernetesディスクリプターは、Kubernetesの様々なフレーバーに対応しています。 link:https://www.openshift.com[OpenShift, window=_blank]、 link:https://quarkus.io/guides/deploying-to-kubernetes#deploying-to-minikube[Minikube, window=_blank]、 link:https://knative.dev[KNative, window=_blank]、そして「バニラ」 link:https://www.kubernetes.io[Kubernetes, window=_blank]です。

source: Kubernetes exposes applications using https://kubernetes.io/docs/concepts/services-networking/ingress[Ingress resources]. To generate the Ingress resource, just apply the following configuration:
ja_jp: Kubernetes は、https://kubernetes.io/docs/concepts/services-networking/ingress イングレスリソースを使用してアプリケーションを公開します。Ingress リソースを生成するには、次の設定を適用するだけです。

source: Kubernetes extension
ja_jp: Kubernetes エクステンション

source: Kubernetes extensions
ja_jp: Kubernetesエクステンション

source: Kubernetes has built-in service discovery and load balancing.
ja_jp: Kubernetesには、組込のサービスディスカバリーとロードバランシングが存在ます。

source: Kubernetes provides multiple ways of defining environment variables:
ja_jp: Kubernetesでは、環境変数を定義する方法が複数用意されています。

source: Kubernetes service binding support for Reactive SQL Clients
ja_jp: Reactive SQL ClientsのKubernetesサービスバインディングのサポート

source: Kubernetes service discovery and load balancing
ja_jp: Kubernetesのサービスディスカバリーとロードバランシング

source: Kubernetes support
ja_jp: Kubernetesサポート

source: Kubernetes will also need these credentials when it comes to pull the image from the registry. This is where image pull secrets are used. An image pull secret is a special kind of secret that contains the required credentials. Quarkus can automatically generate and configure when:
ja_jp: Kubernetesは、レジストリからイメージをプルする際にもこれらのクレデンシャルを必要とします。そこで、イメージプルシークレットが使用されます。イメージプルシークレットは、必要なクレデンシャルを含む特別な種類のシークレットです。Quarkusでは、以下の時、このシークレットを自動的に生成して設定できます：

source: Kubernetes, but also bare metal
ja_jp: Kubernetes、そしてベアメタル

source: L -> https://github.com/grafana/loki[Loki] (logs)
ja_jp: L -> https://github.com/grafana/loki[Loki] (ログ)

source: LRA coordinators
ja_jp: LRAコーディネーター

source: LRA stands for Long Running Actions and the point of it is to provide APIs for services to coordinate activities.
ja_jp: LRAはLong Running Actionsの略で、アクティビティを調整するためのサービスのAPIを提供することがポイントです。

source: LTS releases are supported for 12 months.
ja_jp: LTSリリースは12ヶ月間サポートされます。

source: Label and tag can be used interchangably. You may also see "attribute" used in this context in some documentation. The gist is each that each label or tag or attribute defines an additional bit of information associated with the single numerical measurement that helps you classify, group, or aggregate the measured value later. The Micrometer API uses `Tag` as the mechanism for specifying this additional data.
ja_jp: ラベルとタグは同じ意味で使われています。また、ドキュメントによっては、この文脈で「属性」が使われていることもあります。要するに、それぞれのラベルやタグ、属性は、単一の数値測定に関連する追加の情報を定義するもので、後に測定値を分類したり、グループ化したり、集約したりするのに役立ちます。Micrometer APIでは、この追加データを指定する仕組みとして、 `Tag` を使用しています。

source: Label and tag can be used interchangeably. You may also see "attribute" used in this context in some documentation. The gist is each that each label or tag or attribute defines an additional bit of information associated with the single numerical measurement that helps you classify, group, or aggregate the measured value later. The Micrometer API uses `Tag` as the mechanism for specifying this additional data.
ja_jp: ラベルとタグは同じ意味で使われています。また、ドキュメントによっては、この文脈で「属性」が使われていることもあります。要するに、それぞれのラベルやタグ、属性は、単一の数値測定に関連する追加の情報を定義するもので、後に測定値を分類したり、グループ化したり、集約したりするのに役立ちます。Micrometer APIでは、この追加データを指定する仕組みとして、 `Tag` を使用しています。

source: Labels
ja_jp: ラベル

source: Labels and Annotations
ja_jp: ラベルとアノテーション

source: Language Server client improvements
ja_jp: 言語サーバー・クライアントの改善

source: Language Servers console
ja_jp: 言語サーバー・コンソール

source: Language Servers preferences
ja_jp: 言語サーバーの設定

source: Language and grammar
ja_jp: 言語・文法

source: Language server requests no longer blocking the editor.
ja_jp: 言語サーバーのリクエストがエディタをブロックしなくなりました。

source: Languages
ja_jp: 言語

source: Large REST CRUD application
ja_jp: 大規模 REST CRUD アプリケーション

source: Large integers and decimals.
ja_jp: 大きな整数と小数

source: Larger applications
ja_jp: 大規模なアプリケーション

source: Last Publish Date
ja_jp: 最終公開日

source: Last but not least, we also started <<quarkiverse,the Quarkiverse initiative>>.
ja_jp: 最後ですが重要なことに、 link:#quarkiverse[Quarkiverseの取組] も開始しました。

source: Last stop before the 2.0.0.Final release.
ja_jp: 2.0.0.Finalリリース前の最終地点。

source: Last week, one of of our users (hey, Juan!) asked this question on Zulip:
ja_jp: 先週、私たちのユーザーの一人（ヘイ、Juan！）が、Zulipでこんな質問をしました。

source: Last week, the https://www.youtube.com/watch?v=l3mLKU3wR2A[Quarkus Insights] spotlighted a new project called https://smallrye.io/smallrye-stork[SmallRye Stork] and its integration in Quarkus. In this blog post, we're going to give you a concise introduction to Stork.
ja_jp: 先週の link:https://www.youtube.com/watch?v=l3mLKU3wR2A[Quarkus Insights] では、 link:https://smallrye.io/smallrye-stork[SmallRye Stork]という新しいプロジェクトとそのQuarkusへの統合についてスポットライトを当てました。今回のブログ記事では、Storkについて簡潔にご紹介したいと思います。

source: Lastly different applications can subscribe independently to same topics using different *consumer group ids*. For example, messages published to a topic called _orders_ can be consumed independently on two consumer applications, one with `mp.messaging.incoming.orders.group.id=invoicing` and second with `mp.messaging.incoming.orders.group.id=shipping`. Different consumer groups can thus scale independently according to the message consumption requirements.
ja_jp: 最後に、異なるアプリケーションは、異なる *コンシューマーグループ ID* を使用して同じトピックに個別にサブスクライブすることができます。たとえば、_orders_ というトピックに公開されたメッセージは、2 つのコンシューマーアプリケーションで個別に消費することができます。1 つは `mp.messaging.incoming.orders.group.id=invoicing` で、もう 1 つは `mp.messaging.incoming.orders.group.id=shipping` で消費されます。したがって、さまざまなコンシューマーグループが、メッセージの消費要件に応じて独立してスケーリングすることができます。

source: Lastly, a "Hybrid" approach combines CoT with Retrieval-Augmented Generation (RAG) to ground the reasoning process in factual information, ensuring that the LLM's logical steps are supported by relevant data. These patterns provide flexibility in how CoT is applied, allowing architects to choose the level of control and factual grounding necessary for their specific enterprise AI applications.
ja_jp: 最後に、「ハイブリッド」アプローチは、CoT と Retrieval-Augmented Generation (RAG) を組み合わせ、推論プロセスを事実情報に基づいて確立することで、LLM の論理的ステップが関連データによってサポートされていることを保証します。これらのパターンは、CoT の適用方法に柔軟性をもたらし、アーキテクトが特定のエンタープライズ AI アプリケーションに必要な制御レベルと事実に基づいた基盤を選択できるようにします。

source: Lastly, open your browser and navigate to http://localhost:8080/fruits, you should see:
ja_jp: 最後に、ブラウザーを開いて http://localhost:8080/fruits に移動します。次のように表示されます。

source: Lastly, the REST endpoint class must be updated:
ja_jp: 最後に、RESTエンドポイントクラスを更新する必要があります:

source: Lastly, the _producer_ will read the quotes and send them to the browser using server-sent events. The user will therefore see the quote price updated from _pending_ to the received price in real-time.
ja_jp: 最後に、_プロデューサー_ は見積を読み取り、サーバーから送信されたイベントを使用してブラウザーに送信します。したがって、ユーザーには、見積価格が _保留_ から受信した価格にリアルタイムで更新されていることがわかります。

source: Lastly, the `producer` will read the quotes and send them to the browser using server-sent events. The user will therefore see the quote price updated from _pending_ to the received price in real-time.
ja_jp: 最後に、 `producer` は見積りを読み取り、サーバーから送信されたイベントを使用してこれらをブラウザーに送信します。したがって、ユーザーには、見積り価格が _pending_ から受信した価格にリアルタイムで更新されていることがわかります。

source: Lastly, this does not play well with third party software that do not provide a dedicated build for each customer environment.
ja_jp: 最後に、お客様の環境に合わせて専用のビルドを提供しないサードパーティのソフトウェアとは相性が良くありません。

source: Lastly, you can add pages that is not listed anywhere, but added to the Router, and can be navigated to. This is useful if you are building very complex pages that navigates to more pages.
ja_jp: 最後に、どこにもリストされていませんが、ルーターに追加され、ナビゲートできるページを追加できます。これは、より多くのページにナビゲートする非常に複雑なページを構築している場合に便利です。

source: Later we will discuss how to create this web component page.
ja_jp: この Web コンポーネントページを作成する方法については後で説明します。

source: Later, triggering a login on the client requires obtaining a challenge from the server (see <<Obtain a login challenge>>), which will then be returned to the client which uses that to get the required credentials and send proof of them to the server (see <<Trigger a login>>) which will update the credentials and log you in:
ja_jp: その後、クライアントでログインをトリガーするには、サーバーからチャレンジを取得する必要があります (<<Obtain a login challenge>> を参照）。 取得したチャレンジはクライアントに返され、 クライアントはそれを使用して必要な認証情報を取得し、それらの証明をサーバーに送信します (<<Trigger a login>> を参照）。 サーバーは認証情報を更新し、ユーザーをログインさせます。

source: Later, you configure the `smallrye.jwt.sign.key.location` property to specify the location of the private signing key.
ja_jp: 後で、 `smallrye.jwt.sign.key.location` プロパティーを設定して、秘密署名鍵の場所を指定します。

source: Latest online content in and around Quarkus.
ja_jp: Quarkus周辺の最新オンラインコンテンツ。

source: Launch
ja_jp: 起動

source: Launch Modes
ja_jp: 起動モード

source: Launch Wiremock.
ja_jp: Wiremockを起動します。

source: Launch the application in dev mode
ja_jp: アプリケーションを開発モードで起動します。

source: Launch the application in dev mode using:
ja_jp: 次のコマンドでアプリケーションを開発モードで起動します:

source: Launch the dev mode
ja_jp: 開発モードを起動する

source: Launch the quarkus application in dev mode:
ja_jp: quarkusアプリを開発モードで起動します:

source: Launch your application with the `-XX:AOTCache` JVM flag:
ja_jp: `-XX:AOTCache` JVM フラグを使用してアプリケーションを起動します。

source: Launch your application, you should see your logs arriving inside EFK: you can use Kibana available at http://localhost:5601/ to access them.
ja_jp: アプリケーションを起動すると、EFK内にログが到着しているのが確認できるはずです: それらにアクセスするには、 http://localhost:5601/ で利用可能な Kibana を使用することができます。

source: Launch your application, you should see your logs arriving inside Graylog.
ja_jp: アプリケーションを起動すると、Graylog内にログが届くのがわかるはずです。

source: Launch your application, you should see your logs arriving inside the Elastic Stack; you can use Kibana available at http://localhost:5601/ to access them.
ja_jp: アプリケーションを起動すると、Elastic Stack内にログが届いているのが確認できるはずです。 http://localhost:5601/ で利用できるKibanaを使って、ログにアクセスすることができます。

source: Launching containers
ja_jp: コンテナーの起動

source: Launching multiple instances of the `aggregator` application will make look the overall architecture like so:
ja_jp: `aggregator` アプリケーションの複数のインスタンスを起動すると、全体のアーキテクチャがこのようになります:

source: Layout at a Glance
ja_jp: レイアウトの概要

source: Lazy By Default
ja_jp: デフォルトでは遅延

source: Lazy Instantiation Example
ja_jp: 遅延インスタンス化の例

source: Lazy instantiation - the instance is created once a method is invoked upon the proxy.
ja_jp: 遅延インスタンス化 - メソッドがプロキシーに呼び出されるとインスタンスが生成されます。

source: Leaf certificate name
ja_jp: リーフ証明書名

source: Leaf configuration keys are mapped to non-`private` fields via the `@io.quarkus.runtime.annotations.ConfigItem` annotation.
ja_jp: リーフ設定キーは、 `@io.quarkus.runtime.annotations.ConfigItem` アノテーションを介して `private` 以外のフィールドにマップされます。

source: Learn everything you need to know about the Qute template engine.
ja_jp: Quteのテンプレートエンジンについて知りたい方は、こちらをご覧ください。

source: Learn how to benefit from Java 19 virtual threads when writing REST services in Quarkus.
ja_jp: このガイドではQuarkusでRESTサービスを記述する際にJava 19の仮想スレッドを利用する方法について説明します。

source: Learn how to build and push container images with Jib, OpenShift or Docker as part of the Quarkus build.
ja_jp: Jib、OpenShift、またはDockerを使用して、Quarkusビルドの一部としてコンテナイメージをビルドし、プッシュする方法を学びます。

source: Learn how to build and push container images with Jib, OpenShift, Docker, or Podman as part of the Quarkus build.
ja_jp: Quarkusのビルドの一環として、Jib、OpenShift、Docker、またはPodmanを使用してコンテナイメージをビルドし、プッシュする方法について説明します。

source: Learn how to build and push container images with Jib, S2I or Docker as part of the Quarkus build.
ja_jp: Quarkusのビルドの一部として、Jib、S2I、またはDockerを使用してコンテナイメージをビルドしてプッシュする方法をご紹介します。

source: Learn how to configure gRPC code generation.
ja_jp: gRPCコード生成の設定方法について説明します。

source: Learn how to configure gRPC server and clients.
ja_jp: gRPCサーバーとクライアントの設定方法について説明します。

source: Learn how to create a Hello World Quarkus app. This guide covers:
ja_jp: Hello World Quarkus アプリの作成方法を説明します。 このガイドでは、以下の内容を説明します。

source: Learn how to create a reactive application with Quarkus and explore the different features offered by Quarkus.
ja_jp: Quarkusでリアクティブアプリケーションを作成する方法を学び、Quarkusが提供するさまざまな機能を探索します。

source: Learn how to create, package, and deploy a Hello World Quarkus application including a JAX-RS endpoint and functional tests.
ja_jp: JAX-RSエンドポイントと機能テストを含むHello World Quarkusアプリケーションの作成、パッケージ化、デプロイの方法を学びます。

source: Learn how to customize the Redis client to your needs.
ja_jp: Redisクライアントを自分のニーズに合わせてカスタマイズする方法をご紹介します。

source: Learn how to develop a Dev Service for your extension in order to replace an external service in development mode.
ja_jp: 開発モードで外部サービスを置き換えるために、エクステンション用のDev Serviceを開発する方法を学習します。

source: Learn how to develop a xref:dev-services.adoc[Dev Service] for your extension in order to replace an external service in development mode.
ja_jp: 開発モードで外部サービスを置き換えるために、エクステンション用の xref:dev-services.adoc[Dev Service] を開発する方法について説明します。

source: Learn how to enable bearer token authorization in your Quarkus application by using Keycloak Authorization Services for secure access to protected resources.
ja_jp: 保護されたリソースへの安全なアクセスのために、Keycloak 認可サービスを使用して Quarkus アプリケーションでベアラー トークン認可を有効にする方法を学習します。

source: Learn how to enable bearer token authorization in your Quarkus application by using link:https://www.keycloak.org/docs/latest/authorization_services/index.html[Keycloak Authorization Services] for secure access to protected resources.
ja_jp: 保護されたリソースへ安全にアクセスするために、link:https://www.keycloak.org/docs/latest/authorization_services/index.html[Keycloak Authorization Services] を使用して、Quarkus アプリケーションでベアラートークン認可を有効にする方法を説明します。

source: Learn how to enable bearer token authorization in your Quarkus application using Keycloak Authorization Services for secure access to protected resources.
ja_jp: QuarkusアプリケーションでKeycloak認証サービスを使用してベアラートークン認証を有効にし、保護されたリソースに安全にアクセスする方法を説明します。

source: Learn how to get your extension contribute features to the Dev UI (v1).
ja_jp: エクステンションを Dev UI (v1)に機能貢献させる方法を紹介します。

source: Learn how to get your extension contribute features to the Dev UI.
ja_jp: エクステンションを Dev UI に機能貢献させる方法をご紹介します。

source: Learn how to get your extension to contribute features to the Dev UI (v2).
ja_jp: エクステンションがDev UI (v2)に機能を提供する方法を学習します。

source: Learn how to integrate your extension with Quarkus' CDI container.
ja_jp: エクステンションをQuarkusのCDIコンテナに統合する方法について説明します。

source: Learn how to manage proactive authentication in Quarkus, including customizing settings and handling exceptions.
ja_jp: 設定のカスタマイズや例外処理など、Quarkusでプロアクティブ認証を管理する方法について説明します。

source: Learn how to manage proactive authentication in Quarkus, including customizing settings and handling exceptions. Gain practical insights and strategies for various application scenarios.
ja_jp: 設定のカスタマイズや例外処理など、Quarkusでプロアクティブ認証を管理する方法を学びます。 さまざまなアプリケーションシナリオに対する実践的な洞察と戦略を得ることができます。

source: Learn how to measure the test coverage of your application. This guide covers:
ja_jp: アプリケーションのテストカバレッジを測定する方法をご紹介します。このガイドでは、以下の内容をカバーしています:

source: Learn how to migrate your Vert.x OIDC application to Quarkus and choose to either retain Vert.x OIDC or replace it with Quarkus OIDC.
ja_jp: Vert.x OIDC アプリケーションを Quarkus に移行する方法を学び、Vert.x OIDC をそのまま使い続けるか、Quarkus OIDC に置き換えるかを選択します。

source: Learn how to test your Quarkus Application. This guide covers:
ja_jp: Quarkusアプリケーションのテスト方法について説明します。 このガイドでは、以下の内容について説明します。

source: Learn how to upgrade your projects to the latest version of Quarkus
ja_jp: プロジェクトをQuarkusの最新バージョンにアップグレードする方法を説明します。

source: Learn how to use OpenID Connect (OIDC) and OAuth2 clients with filters to get, refresh, and propagate access tokens in your applications.
ja_jp: OpenID Connect (OIDC) と OAuth2 クライアントにフィルタを使用して、アプリケーションでアクセストークンを取得、更新、伝播する方法を学びます。

source: Learn how to use SmallRye Stork for service discovery and load balancing.
ja_jp: サービスディスカバリーやロードバランシングにSmallRye Storkを使用する方法をご紹介します。

source: Learn how to use SmallRye Stork in a Kubernetes environment.
ja_jp: Kubernetes 環境で SmallRye Stork を使用する方法を学びます。

source: Learn how to use continuous testing in your Quarkus Application.
ja_jp: Quarkusアプリケーションで継続的テストを使用する方法について説明します。

source: Learn how to use the Quarkus OpenID Connect extension (`quarkus-oidc`) together with the https://auth0.com/docs/[Auth0] OIDC provider to protect your API endpoints.
ja_jp: Quarkus OpenID Connect エクステンション (`quarkus-oidc`) と https://auth0.com/docs/[Auth0] OIDC プロバイダーを使用して、API エンドポイントを保護する方法について説明します。

source: Learn how you can reduce the size of your native executables with UPX.
ja_jp: UPXを使用して、ネイティブ実行可能ファイルのサイズを減らす方法をご紹介します。

source: Learn more about Cross Site Replication in the Infinispan Cross Site Replication link:https://infinispan.org/docs/stable/titles/xsite/xsite.html[documentation guide] and in the Infinispan Cross Site Replication link:https://infinispan.org/tutorials/simple/simple_tutorials.html#cross-site-replication_remote-cache-tutorials[simple code tutorial].
ja_jp: Cross Site Replicationについては、Infinispan Cross Site Replication link:https://infinispan.org/docs/stable/titles/xsite/xsite.html[ドキュメントガイド] と Infinispan Cross Site Replication link:https://infinispan.org/tutorials/simple/simple_tutorials.html#cross-site-replication_remote-cache-tutorials[シンプルコードチュートリアル] で詳しく説明しています。

source: Learn more about Dev MCP
ja_jp: Dev MCP の詳細

source: Learn more about Dev UI
ja_jp: Dev UI の詳細

source: Learn more about Quarkus class loading infrastructure.
ja_jp: Quarkusクラスのローディングインフラストラクチャについてはこちらをご覧ください。

source: Learn more about Quarkus extensions metadata
ja_jp: Quarkusエクステンションメタデータについてはこちらをご覧ください。

source: Learn more about Quarkus integrations in IDEs.
ja_jp: IDEのQuarkus統合についてはこちらをご覧ください。

source: Learn more about Quarkus reactive architecture.
ja_jp: Quarkusリアクティブアーキテクチャについてはこちらをご覧ください

source: Learn more about Qute sections https://quarkus.io/guides/qute-reference#sections[here].
ja_jp: Quteの各セクションについては、 link:https://quarkus.io/guides/qute-reference#sections[こちら]をご覧ください。

source: Learn more about configuring Quarkus' Vert.x based HTTP layer - and Undertow if you are using servlets.
ja_jp: QuarkusのVert.xベースのHTTPレイヤーの設定についての詳細と、サーブレットを使用している場合のUndertowについて説明します。

source: Learn more about creating all kinds of Web applications with Quarkus.
ja_jp: Quarkusを使用した、あらゆる種類のWebアプリケーションの作成について詳しく説明します。

source: Learn more about developing reactive applications with Quarkus.
ja_jp: Quarkusを使用したリアクティブアプリケーションの開発については、こちらをご覧ください。

source: Learn more about how Quarkus handles authentication.
ja_jp: Quarkusアプリケーションが認証をどのように扱うかについて詳しく説明します。

source: Learn more about how to configure your Quarkus applications.
ja_jp: Quarkusアプリケーションを設定する方法の詳細について説明します。
